rojarsmith/stm32-knight/stm32-knight-touchgfx-charging-station/gui/TouchGFX/gui/src/model/Model.cpp
#include <gui/model/Model.hpp>
#include <gui/model/ModelListener.hpp>
#include <gui/model/ModelSchema.hpp>

#ifdef SIMULATOR
#include <iostream>
#include <fstream>
#include <filesystem>
#include <iomanip>
#include <direct.h>
#include "json/json.hpp"
using namespace std;
using json = nlohmann::json;
#endif

// Communication
#ifdef __cplusplus
extern "C"
{
#endif 
#ifndef SIMULATOR       
#include "stm32746g_edt_lcd.h"
#include "stm32746g_edt_backlight.h"
#include "../Components/EvboxCommunication/evboxCom.h"
#include "../Components/EvboxCommunication/evmbcrc.h"
#include "../Components/bootloader/inc/usartapi.h"
#include <string.h>
#if 1 // USART Debug Printf examlep check
#include "../Components/bootloader/inc/bootloader.h"
#endif

	extern  bool EVBOX_FORMAT_API_En;
	extern _EVBOX_FORMAT_API R_EVBOX_FORMAT_API;
	extern _EVBOX_FORMAT_API L_EVBOX_FORMAT_API;
	_EVBOX_FORMAT_API* msg;

#endif
#ifdef __cplusplus
}
#endif 

#ifdef SIMULATOR       
const string Model::input_json_filename = "debug_input_data.json";
const string Model::output_json_filename = "debug_output_data.json";
const string Model::path_output = "output";
#endif 

Model::Model() : modelListener(0), tick_(0), ScreenNumberBuf(0xffff),
Communictaion_WaitCtn(COMMUNICATIONTIMER_DURATION)
{
	mstatus_.ux_return_button_clicked = false;

#ifdef SIMULATOR
	//std::ifstream ifs("debug_input_data.json", std::ios::out);
	std::ifstream ifs(input_json_filename, std::ios::out);
	if (true != ifs.is_open())
	{
		string path = "../../../../test/";
		path.append(input_json_filename, 0, sizeof(input_json_filename));
		std::ifstream src(path, std::ios::binary);
		std::ofstream dst(input_json_filename, std::ios::binary);
		dst << src.rdbuf();
		src.close();
		dst.close();
	}
	ifs.close();

	struct stat info;
	if (stat(path_output.c_str(), &info) != 0)
	{
		_mkdir(path_output.c_str());
	}

	if (stat(output_json_filename.c_str(), &info) == 0)
	{
		fstream file(output_json_filename, ios::out);
	}
#else
	if (BSP_BL_Illuminance())
		mstatus_.ux_weather = WeatherStyle(0);
	else
		mstatus_.ux_weather = WeatherStyle::NIGHT;
	mstatus_.ux_prox_sensor_detect_user = true;
	mstatus_.ux_delay_0100_to_0200 = TimeOut_5sec;  //5sec
	mstatus_.ux_socket_status_right = UX_SOCKET_AVAILABLE;
	mstatus_.ux_socket_status_left = UX_SOCKET_AVAILABLE;
	mstatus_.ux_change_screen = 0;
	EnterPopupDelay = TimeOut_10sec;
	ExitPopupDelay = TimeOut_20sec;
	time_out = TimeOut_20sec;
	Use_App_L = false;
	Use_App_R = false;
#endif
}

void Model::tick()
{
    mstatus_.ux_weather_prev = mstatus_.ux_weather;
    mstatus_.ux_plugin_in_out_status_right_prev = mstatus_.ux_plugin_in_out_status_right;
    mstatus_.ux_home_rfid_status_prev = mstatus_.ux_home_rfid_status;
    mstatus_.ux_popup_trigger_prev_ = mstatus_.ux_popup_trigger_;
    mstatus_.ux_popup_number_prev = mstatus_.ux_popup_number;
    mstatus_.ux_change_screen_prev = mstatus_.ux_change_screen;
    mstatus_.ux_close_popup_prev = mstatus_.ux_close_popup;
    mstatus_.ux_socket_status_right_prev = mstatus_.ux_socket_status_right;
    mstatus_.ux_socket_status_left_prev = mstatus_.ux_socket_status_left;
    mstatus_.ux_open_checked_prev = mstatus_.ux_open_checked;
    mstatus_.ux_payment_checked_prev = mstatus_.ux_payment_checked;
    mstatus_.ux_plugin_lock_into_car_prev = mstatus_.ux_plugin_lock_into_car;
    mstatus_.ux_payment_user_selector_prev = mstatus_.ux_payment_user_selector;
    mstatus_.ux_payment_selector_prev = mstatus_.ux_payment_selector;
    mstatus_.ux_screen_status_prev = mstatus_.ux_screen_status;
    mstatus_.ux_prox_sensor_detect_user_prev = mstatus_.ux_prox_sensor_detect_user;
#ifdef SIMULATOR
    bool debug_input_data_modified = false;
    struct stat result;
    if (stat(Model::input_json_filename.c_str(), &result) == 0)
    {
        auto mod_time = result.st_mtime;
        if (mod_time != mod_json_time_prev_)
        {
            debug_input_data_modified = true;
        }
        mod_json_time_prev_ = mod_time;
    }

    if (0 == tick_ % (MODEL_DATA_SCAN_TIME))
    {
        readJsonToMS();
    }
    if (mstatus_.ux_return_button_clicked)
    {
        mstatus_.ux_return_button_clicked = false;
    }
    if (mstatus_.ux_return_s02button1_clicked)
    {
        mstatus_.ux_return_s02button1_clicked = false;
    }
    if (mstatus_.ux_return_s02button2_clicked)
    {
        mstatus_.ux_return_s02button2_clicked = false;
    }
#endif


#ifndef SIMULATOR

    if (mstatus_.ux_output_command_trigger == UX_COMMAND_END) {
        //  if ((mstatus_.ux_screen_status==UX_OPERABLE)&&(ScreenNumberBuf !=     \
        //      (unsigned short)mstatus_.ux_screen_id_current)) {                  

        //      if (ScreenNumberBuf != (unsigned short)mstatus_.ux_screen_id_current) {
        pp_count = 0;
        //      }
        ScreenNumberBuf = (unsigned short)mstatus_.ux_screen_id_current;
        ScrNumBuf = CheckScrId(mstatus_.ux_screen_id_current);

        switch (mstatus_.operation_charge_socket_selected) {
        case CHARGE_SOCKET_NONE:
            if (ScrNumBuf != L_EVBOX_FORMAT_API.FORMAT_Selecttion.Current_screen_num) {
                if (cancel_select) {
                    CancelScr = CheckScrId(mstatus_.ux_screen_id_previous);
                    ScrSel(L_side, cancel_select, CancelScr);
                    ScrSel(R_side, cancel_select, CancelScr);
                    cancel_select = 0;
                }
                if (ScrNumBuf == 1) ScrNumBuf = 0;
                ScrSel(L_side, eEV_NOSELECT, ScrNumBuf);
                ScrSel(R_side, eEV_NOSELECT, ScrNumBuf);
            }
            break;
        case CHARGE_SOCKET_RIGHT:
            if (ScrNumBuf != R_EVBOX_FORMAT_API.FORMAT_Selecttion.Current_screen_num) {
                if (cancel_select) {
                    ScrSel(R_side, cancel_select, ScrNumBuf);
                    ScrSel(L_side, cancel_select, ScrNumBuf);
                    cancel_select = 0;
                }
                else {
                    if ((ScrNumBuf == 0x0265) && (mstatus_.ux_screen_id_previous == SCREEN_HOME)) {
                        ScrSel(R_side, eEV_SELECTTHISSIDE, ScrNumBuf);
                        ScrSel(R_side, eEV_NOSELECT, ScrNumBuf);
                        ScrSel(L_side, eEV_OTHERSIDESELECTED, ScrNumBuf);
                        ScrSel(L_side, eEV_NOSELECT, ScrNumBuf);
                    }
                    else {
                        ScrSel(L_side, eEV_NOSELECT, ScrNumBuf);
                        ScrSel(R_side, eEV_NOSELECT, ScrNumBuf);
                    }
                }
            }
            break;
        case CHARGE_SOCKET_LEFT:
            if (ScrNumBuf != L_EVBOX_FORMAT_API.FORMAT_Selecttion.Current_screen_num) {
                if (cancel_select) {
                    ScrSel(L_side, cancel_select, ScrNumBuf);
                    ScrSel(R_side, cancel_select, ScrNumBuf);
                    cancel_select = 0;
                }
                else {
                    if ((ScrNumBuf == 0x0265) && (mstatus_.ux_screen_id_previous == SCREEN_HOME)) {
                        ScrSel(L_side, eEV_SELECTTHISSIDE, ScrNumBuf);
                        ScrSel(L_side, eEV_NOSELECT, ScrNumBuf);
                        ScrSel(R_side, eEV_OTHERSIDESELECTED, ScrNumBuf);
                        ScrSel(R_side, eEV_NOSELECT, ScrNumBuf);
                    }
                    else {
                        ScrSel(L_side, eEV_NOSELECT, ScrNumBuf);
                        ScrSel(R_side, eEV_NOSELECT, ScrNumBuf);
                    }
                }
            }
            break;
        default:
            break;
        }
    }

    User_detected = GetProximity();
    //    switch(mstatus_.ux_screen_id_current){
    switch (ScreenNumberBuf) {
    case SCREEN_WELCOME:
        pop_one = true;
        enter_standby = false;
        mstatus_.ux_delay_0200_to_0000 = TimeOut_30sec;
        break;

    case SCREEN_STANDBY:
        if (mstatus_.popup_opened) {
            ccount = 0;
            PopUp_Close(1);
            break;
        }
        if (home_flag) {
            mstatus_.ux_change_screen = GO_HOME;
        }
        else if ((enter_standby) && (++ccount > 10)) {
            mstatus_.ux_prox_sensor_detect_user = false;
            enter_standby = false;
            ccount = 0;
            mstatus_.ux_change_screen = 0;
        }
        else {
            mstatus_.ux_prox_sensor_detect_user = User_detected;
            mstatus_.ux_delay_0100_to_0200 = TimeOut_5sec;    //300;
        }

        break;
    case SCREEN_HOME:
        if (home_flag) {
            home_flag = false;
            pop_status = true;
            mstatus_.popup_opened = false;    // foced to change popup status
            mstatus_.ux_popup_number = MESSAGE_0;
            mstatus_.ux_prox_sensor_detect_user = true;
            mstatus_.ux_change_screen = 0;
            if (enter_standby) {
                mstatus_.ux_change_screen = GO_STANDBY;
                enter_standby = User_detected;
                ccount = 0;
            }
            time_out = TimeOut_20sec;
        }
        else {
            mstatus_.ux_prox_sensor_detect_user = User_detected;
        }
        drag_flag = (mstatus_.ux_drag_selector_vx < 2) && (mstatus_.ux_drag_selector_vx > -2);

        if (charge_stop) {
            PopUp_Open(COMMUNICATIONTIMER_DURATION + 1, (MessageNumber)charge_stop);        //MESSAGE_22 ~ 28;                          
        }
        else if (pop_one) {
            PopUp_Open(EnterPopupDelay, MESSAGE_21);
        }
        pop1[0] = true;
        pop1[1] = true;
        pop1[2] = true;

        if (tick_ & 0x10) {         //update weather status per 16 ticks
            if (BSP_BL_Illuminance()) {
                mstatus_.ux_weather = WeatherStyle(0);
            }
            else {
                mstatus_.ux_weather = WeatherStyle::NIGHT;
            }
        }
        break;

    case SCENARIO_2_2:
        cancel_select = eEV_STOPTRANSCATION;
    case SCENARIO_2_3:
    case SCENARIO_2_4:
        charge_stop = 0;
    case SCENARIO_2_5:
        session_stop = false;
    case SCENARIO_2_1:        //close MESSAGE_21
    case SCENARIO_2_36:       //-->0x026F
    case SCENARIO_2_37:       //-->0x0270
    case SCENARIO_2_38:       //-->0x0271   
        if (mstatus_.ux_return_value == RETURN_OK) {
            mstatus_.ux_popup_number = MESSAGE_0;
        }
        PopUp_Close(ExitPopupDelay);
        if (pop_status == false) {
            if (ScreenNumberBuf == SCENARIO_2_5) {
                charge_stop = MESSAGE_26;
                ccount = 0;
                break;
            }
            else charge_stop = 0;
            idx = ScreenNumberBuf - 0x0236;
            pop1[0] = true;
            pop1[1] = true;
            pop1[2] = true;
            if (idx < 3) {
                pop1[idx] = false;
            }
        }
        break;
    case SCENARIO_2_30:                 //show info. using charge cad, 2.10.A-->0x0265
        if (home_flag) {
            home_flag = false;
            pop_status = true;
            //              mstatus_.popup_opened = false;    // foced to change popup status
            mstatus_.ux_popup_number = MESSAGE_0;
            mstatus_.ux_change_screen = 0;
        }
        else if (mstatus_.ux_return_value == RETURN_OK) {
            home_flag = false;
        }
    case SCENARIO_2_31:                //show info. using credit cad, 2.10.B-->0x0266
    case SCENARIO_2_32:                //show info. using qr code, 2.10.C-->0x0267
        if (mstatus_.ux_return_button_clicked) {
            mstatus_.ux_return_button_clicked = false;
            mstatus_.ux_change_screen = GO_HOME;
            cancel_select = eEV_CANCELSELECTION;
            pp_count = 0;
            home_flag = true;
            break;
        }
        idx = ScreenNumberBuf - 0x0230;
        if (pop1[idx]) {
            PopUp_Open(EnterPopupDelay, (MessageNumber)(ScreenNumberBuf - 259));
        }
        break;

    case SCENARIO_2_33:
        if (home_flag) {
            mstatus_.ux_change_screen = GO_PAYMENT;
        }
        break;
    case SCENARIO_4_1:
    case SCENARIO_5_2:
    case SCENARIO_5_3:
        if (home_flag) {
            mstatus_.ux_change_screen = GO_HOME;
        }
        break;
    case SCENARIO_4_3:
        if (!home_flag) {
            if (mstatus_.ux_return_button_clicked) {
                mstatus_.ux_return_button_clicked = false;
                mstatus_.ux_popup_number = MESSAGE_44;
            }
            else {
                PopUp_Open(EnterPopupDelay, MESSAGE_44);
            }
        }
        else {
            if (mstatus_.ux_screen_status == UX_OPERABLE) {
                mstatus_.ux_change_screen = GO_HOME;
            }
        }
        break;
    case SCREEN_CONNECT:        //SCREEN NUMBER :5.0  
        if (!home_flag) {
            if (mstatus_.ux_return_button_clicked) {
                mstatus_.ux_return_button_clicked = false;
                mstatus_.ux_popup_number = MESSAGE_51;
                session_stop = true;
            }
            else if (PopUp_Open(EnterPopupDelay, MESSAGE_51)) {
                session_stop = true;
            }
        }
        else {
            if (mstatus_.ux_screen_status == UX_OPERABLE) {
                mstatus_.ux_change_screen = GO_HOME;
            }
        }
        break;

