rojarsmith/stm32-knight/stm32-knight-touchgfx-charging-station/gui/TouchGFX/gui/src/model/Model.cpp
    case SCENARIO_5_1:
        if ((PopUp_Close(TimeOut_20sec) == false) && session_stop) {
            home_flag = true;
            charge_stop = MESSAGE_22;
            break;
        }
    case SCENARIO_4_4:
        if (mstatus_.ux_return_value != RETURN_NONE) {
            pop_status = false;
            mstatus_.ux_popup_number = MESSAGE_0;
            session_stop = false;
            if (mstatus_.ux_return_value == RETURN_OK) {
                home_flag = true;
                session_stop = true;
                charge_stop = MESSAGE_22;
            }
        }
        break;

    case SCENARIO_2_6:
        //          if (charge_stop == MESSAGE_26) charge_stop = 0;
        if (User_detected) {
            pp_count = 0;
            //            if ((++ccount % TimeOut_120sec == 0)||       \
            //                  (mstatus_.ux_return_value == RETURN_OK)) {
            if (++ccount > TimeOut_120sec) {
                enter_standby = true;
                home_flag = true;
                PopUp_Close(1);
                charge_stop = 0;
            }
            //          } else if ((PopUp_Close(TimeOut_5sec) == false)||       \
            //                     (mstatus_.ux_return_value == RETURN_OK)) {
        }
        else if (PopUp_Close(TimeOut_5sec) == false) {
            enter_standby = false;
            home_flag = true;
            charge_stop = (Use_App_L || Use_App_R) ? MESSAGE_28 : MESSAGE_27;
        }
        break;

    case SCENARIO_2_7:
    case SCENARIO_2_8:
        charge_stop = 0;
        enter_standby = true;
    case SCENARIO_5_4:

    case SCENARIO_9_1:
    case SCENARIO_9_2:
    case SCENARIO_9_3:
    case SCENARIO_9_4:
    case SCENARIO_9_5:
    case SCENARIO_9_6:
        if ((PopUp_Close(TimeOut_20sec) == false) || \
            (mstatus_.ux_return_value == RETURN_OK)) {
            home_flag = true;
        }
        Errpopup = 0;
        break;

    case NULL_SCREEN:

    default:

        break;
    }

    if (mstatus_.ux_screen_id_next == NULL_SCREEN) {
        if (mstatus_.ux_output_command_trigger != UX_COMMAND_ON)
            EVBox_CommunicationIDLE = false;   //ACK    
    }
    else {
        if (mstatus_.ux_output_command_trigger == UX_COMMAND_ON) {
            EVBox_CommunicationIDLE = true;   //NACK
            Communictaion_WaitCtn = COMMUNICATIONTIMER_DURATION;
        }
    }

    if (Communictaion_WaitCtn > 0) { // waiting UI Process Used 5 tick 

        Communictaion_WaitCtn--;
        if (Communictaion_WaitCtn == 0) {

            Communictaion_WaitCtn = COMMUNICATIONTIMER_DURATION;

            if (R_EVBOX_FORMAT_API_En) {
                if (!mstatus_.popup_opened) {
                    R_EVBOX_FORMAT_API_En = false;
                    Msg_Conver(0);
                }
                else {
                    if (R_EVBOX_FORMAT_API.EVBox_FormatEvent & Event_CHARGE_STATUS) {
                        PopUp_Close(1);
                        session_stop = false;
                    }
                }
            }
            else if (L_EVBOX_FORMAT_API_En) {
                if (!mstatus_.popup_opened) {
                    L_EVBOX_FORMAT_API_En = false;
                    Msg_Conver(1);
                }
                else {
                    if (L_EVBOX_FORMAT_API.EVBox_FormatEvent & Event_CHARGE_STATUS) {
                        PopUp_Close(1);
                        session_stop = false;
                    }
                }
            }
        }
    }


#endif

    if (UXCommandStatus::UX_COMMAND_OFF != mstatus_.ux_output_command_trigger)
    {
#ifdef SIMULATOR
        writeMSToJson();
#endif	        
    }

    mstatus_.ux_popup_trigger_ = false;
    mstatus_.ux_output_command_trigger = UXCommandStatus::UX_COMMAND_OFF;
    mstatus_.ui_tick = tick_;

    tick_++;
    if (tick_ >= (60 * 1000))
    {
        tick_ = 0;
    }
}

#ifdef SIMULATOR
void Model::readJsonToMS()
{
    //Input to UX.
    std::ifstream ifs(input_json_filename);
    std::string content((std::istreambuf_iterator<char>(ifs)),
        (std::istreambuf_iterator<char>()));
    ifs.close();

    //Debug
    //printf("%s", content.c_str());
    //fflush(0);

    json j = json::parse(content);

    int v1_test = j["edt"][0]["attribute"]["age"]["value"].get<int>();

    int ux_pop_tran_in_time = j["ux_pop_tran_in_time"].get<int>();
    int ux_pop_tran_out_time = j["ux_pop_tran_out_time"].get<int>();
    int ux_pop_stay_time = j["ux_pop_stay_time"].get<int>();
    int ux_delay_0100_to_0200 = j["ux_delay_0100_to_0200"].get<int>();
    int ux_delay_0200_to_0201 = j["ux_delay_0200_to_0201"].get<int>();
    int ux_delay_0200_to_0000 = j["ux_delay_0200_to_0000"].get<int>();
    int ux_socket_status_right = j["ux_socket_status_right"].get<int>();
    int ux_socket_status_left = j["ux_socket_status_left"].get<int>();
    int ux_plugin_in_out_status_right = j["ux_plugin_in_out_status_right"].get<int>();
    int ux_plugin_in_out_status_left = j["ux_plugin_in_out_status_left"].get<int>();
    int ux_plugin_usability_status_right = j["ux_plugin_usability_status_right"].get<int>();
    int ux_plugin_usability_status_left = j["ux_plugin_usability_status_left"].get<int>();
    int ux_plugin_lock_into_car = j["ux_plugin_lock_into_car"].get<int>();
    int ux_weather = j["ux_weather"].get<int>();
    int ux_prox_sensor_detect_user = j["ux_prox_sensor_detect_user"].get<int>();
    int ux_home_rfid_status = j["ux_home_rfid_status"].get<int>();
    int ux_payment_user_selector = j["ux_payment_user_selector"].get<int>();
    int ux_payment_selector = j["ux_payment_selector"].get<int>();
    int ux_open_checked = j["ux_open_checked"].get<int>();
    int ux_payment_checked = j["ux_payment_checked"].get<int>();
    int ux0400_plug_right_status = j["ux0400_plug_right_status"].get<int>();
    int ux0400_plug_left_status = j["ux0400_plug_left_status"].get<int>();
    string ux_qr_data = j["ux_qr_data"].get<string>();
    string ux_phone = j["ux_phone"].get<string>();
    string ux_datetime = j["ux_datetime"].get<string>();
    string ux_per_kwh = j["ux_per_kwh"].get<string>();
    string ux_max_kw = j["ux_max_kw"].get<string>();
    int ux_culture = j["ux_culture"].get<int>();
    int ux_change_screen = j["ux_change_screen"].get<int>();
    int ux_popup_number = mstatus_.ux_popup_number;
    if (!mstatus_.ux_popup_trigger_)
    {
        ux_popup_number = j["ux_popup_number"].get<int>();
    }
    int ux_close_popup = j["ux_close_popup"].get<int>();
    string ux_duration_h = j["ux_duration_h"].get<string>();
    string ux_duration_m = j["ux_duration_m"].get<string>();
    string ux_energy = j["ux_energy"].get<string>();
    string ux_paid = j["ux_paid"].get<string>();
    string ux_charger_id = j["ux_charger_id"].get<string>();

