rojarsmith/stm32-knight/stm32-knight-touchgfx-charging-station/gui/TouchGFX/gui/src/model/Model.cpp
    mstatus_.ux_pop_tran_in_time = ux_pop_tran_in_time,
        mstatus_.ux_pop_tran_out_time = ux_pop_tran_out_time,
        mstatus_.ux_pop_stay_time = ux_pop_stay_time,
        mstatus_.ux_delay_0100_to_0200 = ux_delay_0100_to_0200,
        mstatus_.ux_delay_0200_to_0201 = ux_delay_0200_to_0201;
    mstatus_.ux_delay_0200_to_0000 = ux_delay_0200_to_0000;
    mstatus_.ux_socket_status_right = ux_socket_status_right,
        mstatus_.ux_socket_status_left = ux_socket_status_left,
        mstatus_.ux_plugin_in_out_status_right = ux_plugin_in_out_status_right;
    mstatus_.ux_plugin_in_out_status_left = ux_plugin_in_out_status_left;
    mstatus_.ux_plugin_usability_status_right = ux_plugin_usability_status_right;
    mstatus_.ux_plugin_usability_status_left = ux_plugin_usability_status_left;
    mstatus_.ux_plugin_lock_into_car = ux_plugin_lock_into_car;
    switch (ux_weather)
    {
    case 1:
        mstatus_.ux_weather = WeatherStyle::NIGHT;
        break;
    default:
        mstatus_.ux_weather = WeatherStyle::DAY;
        break;
    }
    mstatus_.ux_prox_sensor_detect_user = ux_prox_sensor_detect_user;
    mstatus_.ux_home_rfid_status = ux_home_rfid_status;
    mstatus_.ux_payment_user_selector = ux_payment_user_selector;
    mstatus_.ux_payment_selector = ux_payment_selector;
    mstatus_.ux_open_checked = ux_open_checked;
    mstatus_.ux_payment_checked = ux_payment_checked;
    mstatus_.ux0400_plug_right_status = ux0400_plug_right_status;
    mstatus_.ux0400_plug_left_status = ux0400_plug_left_status;
    strcpy_s(mstatus_.ux_qr_data, 257, ux_qr_data.c_str());
    strcpy_s(mstatus_.ux_phone, 21, ux_phone.c_str());
    strcpy_s(mstatus_.ux_datetime, 21, ux_datetime.c_str());
    strcpy_s(mstatus_.ux_per_kwh, 6, ux_per_kwh.c_str());
    strcpy_s(mstatus_.ux_max_kw, 6, ux_max_kw.c_str());
    if (0 > ux_culture || 4 < ux_culture)
    {
        mstatus_.ux_culture = LanguageList::ENGISH;
    }
    else
    {
        mstatus_.ux_culture = (LanguageList)ux_culture;
    }
    mstatus_.ux_change_screen = ux_change_screen;
    mstatus_.ux_popup_number = ux_popup_number;
    mstatus_.ux_close_popup = ux_close_popup;
    strcpy_s(mstatus_.ux_duration_h, 3, ux_duration_h.c_str());
    strcpy_s(mstatus_.ux_duration_m, 3, ux_duration_m.c_str());
    strcpy_s(mstatus_.ux_energy, 7, ux_energy.c_str());
    strcpy_s(mstatus_.ux_paid, 7, ux_paid.c_str());
    strcpy_s(mstatus_.ux_charger_id, ux_charger_id.c_str());
}

void Model::writeMSToJson()
{
    mstatus_.ux_output_command_trigger_count++;

    //Output from UX.
    json jo;
    //Send from display.
    jo["ux_screen_id_next"] = mstatus_.ux_screen_id_next;
    jo["ux_screen_id_current"] = mstatus_.ux_screen_id_current;
    jo["ux_screen_id_previous"] = mstatus_.ux_screen_id_previous;
    jo["ux_screen_id_next_bk1"] = mstatus_.ux_screen_id_next_bk1;
    jo["ux_screen_id_current_bk1"] = mstatus_.ux_screen_id_current_bk1;
    jo["ux_screen_id_previous_bk1"] = mstatus_.ux_screen_id_previous_bk1;
    //Command must be send.
    jo["ux_output_command_trigger"] = mstatus_.ux_output_command_trigger;
    //Each ux_output_command_trigger 0=>1 will +1
    jo["ux_output_command_trigger_count"] = mstatus_.ux_output_command_trigger_count;
    //Operable. 0=OPERABLE, 1=OPERABLE, Other=0.
    jo["ux_screen_status"] = mstatus_.ux_screen_status;

    jo["operation_charge_socket_selected"] = mstatus_.operation_charge_socket_selected;
    std::ofstream ofs(output_json_filename, std::ofstream::out | std::ofstream::app);
    ofs << std::setw(4) << jo << std::endl;
}
#endif

MachineStatus* Model::getMachineStatus()
{
    return &mstatus_;
}

#ifndef SIMULATOR  
bool Model::PopUpProcess(bool pop_en, int enter_delay, int exit_delay, MessageNumber mesg)
{
    if (!pop_en) {
        PopUp_Close(1);
        return pop_status;
    }

    if (pop_status == false) {      //Waiting timeout to popup message
        PopUp_Open(enter_delay, mesg);
    }
    else {                         //Waiting timeout to close message
        PopUp_Close(exit_delay);
    }
    return pop_status;
}
bool Model::PopUp_Open(int enter_delay, MessageNumber mesg)
{
    if ((mstatus_.popup_opened) || (mstatus_.ux_return_s02button1_clicked)) {
        pp_count = 0;
        pop_status = true;
        mstatus_.ux_return_s02button1_clicked = false;
        pop_one = false;
    }
    else if ((++pp_count >= enter_delay) && (mstatus_.ux_screen_status == UX_OPERABLE)) {
        if ((drag_flag) || (ScreenNumberBuf != SCREEN_HOME)) { //Don't allowed pop-up when sliding
            mstatus_.ux_popup_number = mesg;
        }
        pp_count = 0;
        pop_status = true;
        pop_one = false;
    }
    return pop_status;
}
bool Model::PopUp_Close(int exit_delay)
{
    if (!mstatus_.popup_opened) {
        pp_count = 0;
        pop_status = false;
        mstatus_.ux_popup_number = MESSAGE_0;
    }
    else if (++pp_count >= exit_delay) {
        if ((mstatus_.popup_opened) && (mstatus_.ux_screen_status == UX_OPERABLE)) {
            //    if ((mstatus_.popup_opened)&&(mstatus_.ux_output_command_trigger==UX_COMMAND_OFF)) {
            if (mstatus_.ux_close_popup) {
                mstatus_.ux_close_popup = 0;
            }
            else {
                mstatus_.ux_close_popup = 1;
                mstatus_.ux_popup_number = MESSAGE_0;
                pp_count = 0;
                pop_status = false;
                pop_one = false;
            }
        }
    }
    return pop_status;
}
void Model::ScrSel(bool RL, unsigned short sel, unsigned short scr)
{
    unsigned short boxid;
    if (RL) {
        msg = (&L_EVBOX_FORMAT_API);
        boxid = EVBOX_ChargeBox_Lplug;
    }
    else {
        msg = (&R_EVBOX_FORMAT_API);
        boxid = EVBOX_ChargeBox_Rplug;
    }

    msg->FORMAT_Selecttion.Screen = sel & 0x00ff;
    msg->FORMAT_Selecttion.Current_screen_num = scr;
    msg->FORMAT_Selecttion.Proximity = User_detected;//(char)GetProximity();
    msg->FORMAT_Selecttion.DayNight = (char)mstatus_.ux_weather;

