rojarsmith/stm32-knight/stm32-knight-touchgfx-charging-station/gui/TouchGFX/gui/src/model/Model.cpp
    msg->EVBox_FormatEvent |= Event_SELECT_SCREEN;
    EVBOX_Transimt_ScreenSelect_API(boxid, &msg->FORMAT_Selecttion);
    EVBox_CommunicationIDLE = false;
}

unsigned short Model::CheckScrId(ScreenNumber scr_id)
{
    unsigned short scrid16;

    scrid16 = (unsigned short)scr_id;
    switch (scr_id)
    {
        //    case NULL_SCREEN     : //0, //0x9999,
        //      scrid16 = 0x1;
        //      break;
        //    case SCREEN_BOOT     : // 1, //0x9998,
        //      scrid16 = 0x0;
        //      break;
    case SCREEN_STANDBY: // 2, //0x0000,
    case SCREEN_WELCOME: // 3, //0x0100,
    case SCREEN_HOME: // 4, //0x0200,
    case SCREEN_PAYMENT: // 5, //0x0300,
    case SCREEN_PAY_RFID: // 6, //0x0400,
    case SCREEN_CONNECT: // 7, //0x0500,
    case SCREEN_SCREEN1: // 8 //
        scrid16 = (scrid16 - 2) << 8;
        break;
    case SCENARIO_2_30: // 0x0230, 2.10.A -> 0x0265 
    case SCENARIO_2_31: // 0x0231, 2.10.B -> 0x0266
    case SCENARIO_2_32: // 0x0232, 2.10.C -> 0x0267
        scrid16 += 0x35;
        break;
    case SCENARIO_2_36: // 0x0236, 2.11.A -> 0x026F
    case SCENARIO_2_37: // 0x0237, 2.11.B -> 0x0270
    case SCENARIO_2_38: // 0x0238, 2.11.C -> 0x0271  
        scrid16 += 0x39;
        break;
    case SCENARIO_2_33: // 0x0233, 2.12 -> 0x020C
    case SCENARIO_2_34: // 0x0234, 2.13 -> 0x020D 
        scrid16 -= 0x27;
        break;

    default:
        break;
    }
    return scrid16;
}

void Model::Msg_Conver(bool RL)
{
    pp_count = 0;
    msg = (RL) ? (&L_EVBOX_FORMAT_API) : (&R_EVBOX_FORMAT_API);
    msg->FORMAT_Selecttion.DayNight = mstatus_.ux_weather;
    if (msg->EVBox_FormatEvent & Event_CHARGE_STATUS) {//0x73
        EVBox_CommunicationIDLE = true;
        if (msg->FORMAT_STATUS.ErrorNumber) {
            if (msg->FORMAT_STATUS.ErrorNumber < 7) {
                mstatus_.ux_popup_number = msg->FORMAT_STATUS.ErrorNumber + 900;
                //            if (msg->FORMAT_STATUS.ErrorNumber==3) {
                //              if (RL) {
                //                  mstatus_.ux_socket_status_left = UX_SOCKET_ERROR;
                //              } else {
                //                  mstatus_.ux_socket_status_right = UX_SOCKET_ERROR;
                //              }
                //            } 
            }
            else {
                mstatus_.ux_popup_number = 0;
                mstatus_.ux_change_screen = GO_HOME;
                //            if (RL) {
                //                mstatus_.ux_socket_status_left = 0;
                //            } else {
                //                mstatus_.ux_socket_status_right = 0;
                //            }
            }
            mstatus_.ux_home_rfid_status = 0;
            mstatus_.ux_payment_user_selector = 0;

        }
        else {
            switch (msg->FORMAT_STATUS.Charge)
            {
            case eEV_NONE:                    //0
            case eEV_STATION_IDLE:    //1   
                break;
            case eEV_AUTH_REQU:    //2 
                if (mstatus_.ux_screen_id_current == SCREEN_HOME)
                {
                    mstatus_.ux_home_rfid_status = 2;         //RFID detect(Charge Card)         
                }
                else
                {
                    Use_CreditCard = (mstatus_.ux_screen_id_current == SCENARIO_2_31);
                    mstatus_.ux_payment_user_selector = 2;
                    mstatus_.ux_payment_selector = 0;
                    mstatus_.ux_payment_checked = 0;
                }
                break;

            case eEV_AUTH_ACCE:    //3
                if (mstatus_.ux_screen_id_current == SCENARIO_4_1) {  //SCREEN_PAY_RFID
                    mstatus_.ux_home_rfid_status = 4;         //RFID OK
                }
                else if (mstatus_.ux_screen_id_current == SCENARIO_2_33) {  //credit card payment
                    mstatus_.ux_payment_user_selector = 0;
                    mstatus_.ux_payment_selector = 2;         //charge card or credit card ok               
                }
                else if (mstatus_.ux_screen_id_current == SCENARIO_2_32) {   //QR code OK 
                    mstatus_.ux_payment_user_selector = 1;
                    mstatus_.ux_payment_selector = 4;
                }
                break;

            case eEV_PLUG_UNLOCKED:    //4      
                //mstatus_.ux_plugin_lock_into_car =0;
                mstatus_.ux_home_rfid_status = 8;         //RFID Unlock
                if (mstatus_.ux_screen_id_current == SCENARIO_2_34) {
                    mstatus_.ux_payment_checked = 1;         //charge card or credit card ok  

            case eEV_PLUG_REMOVED:    //5  
                (RL) ? (mstatus_.ux0400_plug_left_status = 2)        \
                    : (mstatus_.ux0400_plug_right_status = 2);
                }
                mstatus_.ux_open_checked = 0;
                break;

            case eEV_PLUG_CONN2CAR:    //6 
                mstatus_.ux_open_checked = 1;
                mstatus_.ux_payment_checked = 0;
                mstatus_.ux0400_plug_left_status = 0;
                mstatus_.ux0400_plug_right_status = 0;
                break;

            case eEV_START_REQE:    //7
                //mstatus_.ux_plugin_lock_into_car =1;
                //mstatus_.ux_open_checked=2;
                mstatus_.ux_payment_checked = 1;
                break;

            case eEV_START_ACCE:    //8
                mstatus_.ux_popup_number = MESSAGE_54;
                if (RL)
                    mstatus_.ux_socket_status_left = UX_SOCKET_CHARGING;
                else
                    mstatus_.ux_socket_status_right = UX_SOCKET_CHARGING;
                break;

            case eEV_REMOTE_START:    //9
                mstatus_.ux_payment_user_selector = 1;
                break;

            case eEV_REMOTE_STOP:    //15
                (RL) ? (Use_App_L = true) : (Use_App_R = true);
            case eEV_STOP_WITH_CARD:    //14   
                //                mstatus_.ux_popup_number = MESSAGE_23;
            case eEV_CAR_DISCONNECT:    //13
                if (RL) {
                    mstatus_.ux0400_plug_left_status = 1;
                    mstatus_.ux_socket_status_left = UX_SOCKET_WARNING;
                }
                else {
                    mstatus_.ux0400_plug_right_status = 1;
                    mstatus_.ux_socket_status_right = UX_SOCKET_WARNING;
                }

