rojarsmith/stm32-knight/stm32-knight-touchgfx-charging-station/gui/TouchGFX/gui/src/model/Model.cpp
                if ((msg->FORMAT_STATUS.Charge == eEV_CAR_DISCONNECT) && \
                    (Use_CreditCard)) {
                    if (ScreenNumberBuf == SCREEN_STANDBY) {
                        charge_stop = MESSAGE_24;
                        home_flag = true;
                    }
                    else {
                        mstatus_.ux_popup_number = MESSAGE_24;
                    }
                }
                else {
                    if (ScreenNumberBuf == SCREEN_STANDBY) {
                        charge_stop = MESSAGE_25;
                        home_flag = true;
                    }
                    else {
                        mstatus_.ux_popup_number = MESSAGE_25;
                    }
                }
                break;

            case eEV_TRANSACTION_ENDED:    //16
                if (RL)
                    mstatus_.ux_socket_status_left = UX_SOCKET_FULL;
                else
                    mstatus_.ux_socket_status_right = UX_SOCKET_FULL;
                //mstatus_.ux_popup_number = MESSAGE_25;
                charge_stop = MESSAGE_25;
                break;

            case eEV_REMOVE_PLUG_FCARD:    //17
                if (RL) {
                    mstatus_.ux0400_plug_left_status = 2;
                }
                else {
                    mstatus_.ux0400_plug_right_status = 2;
                }
                break;

            case eEV_PUT_CABLE_INSTATION:    //18
                if (RL) {
                    mstatus_.ux0400_plug_left_status = 1;
                }
                else {
                    mstatus_.ux0400_plug_right_status = 1;
                }
                mstatus_.ux_popup_number = MESSAGE_26;
                break;

            case eEV_THANKS_AND_GOODBYE:    //19 
                if (RL) {
                    mstatus_.ux_socket_status_left = UX_SOCKET_AVAILABLE;
                    if (Use_App_L)
                    {
                        Use_App_L = false;
                        charge_stop = MESSAGE_28;
                    }
                    else
                        charge_stop = MESSAGE_27;
                }
                else {
                    mstatus_.ux_socket_status_right = UX_SOCKET_AVAILABLE;
                    if (Use_App_R)
                    {
                        Use_App_R = false;
                        charge_stop = MESSAGE_28;
                    }
                    else
                        charge_stop = MESSAGE_27;
                }
                mstatus_.ux_payment_user_selector = 0;
                mstatus_.ux_plugin_lock_into_car = 0;
                //            mstatus_.operation_charge_socket_selected = CHARGE_SOCKET_NONE;       
                break;

            case eEV_CHARGEING_STATE_B:    //10
            case eEV_CHARGEING_STATE_C:    //11
            case eEV_CHARGEING_ON_HOLD:    //12        
                if (RL) {
                    mstatus_.ux_socket_status_left = (UXSocketStatus)msg->FORMAT_STATUS.Led_color;
                }
                else {
                    mstatus_.ux_socket_status_right = (UXSocketStatus)msg->FORMAT_STATUS.Led_color;
                }
                break;

            default:
                if (RL) {
                    mstatus_.ux_socket_status_left = UX_SOCKET_WARNING;
                }
                else {
                    mstatus_.ux_socket_status_right = UX_SOCKET_WARNING;
                }
                break;
            }

            if (RL) {   //check the status of pluk_lock & plug_in_station
                mstatus_.ux_plugin_in_out_status_left = !msg->FORMAT_STATUS.Plug_inStation;
                mstatus_.ux_plugin_usability_status_left = !msg->FORMAT_STATUS.Plug_lock;
                //            mstatus_.ux_socket_status_left = (UXSocketStatus)msg->FORMAT_STATUS.Led_color;
            }
            else {
                mstatus_.ux_plugin_in_out_status_right = !msg->FORMAT_STATUS.Plug_inStation;
                mstatus_.ux_plugin_usability_status_right = !msg->FORMAT_STATUS.Plug_lock;
                //            mstatus_.ux_socket_status_right = (UXSocketStatus)msg->FORMAT_STATUS.Led_color;
            }

        }

        msg->EVBox_FormatEvent = msg->EVBox_FormatEvent & (~Event_CHARGE_STATUS);
    }

    if (msg->EVBox_FormatEvent & Event_CHARGE_INFO) {//0x74
        sprintf(mstatus_.ux_duration_h, "%d", msg->FORMAT_INFO.Charge_time / 60 / 60);
        sprintf(mstatus_.ux_duration_m, "%d", msg->FORMAT_INFO.Charge_time / 60 % 60);
        sprintf(mstatus_.ux_energy, "%d", msg->FORMAT_INFO.Current_power);
        sprintf(mstatus_.ux_paid, "%d", msg->FORMAT_INFO.TotalCost);

        msg->EVBox_FormatEvent = msg->EVBox_FormatEvent & (~Event_CHARGE_INFO);
    }

    if (msg->EVBox_FormatEvent & Event_SET_DISPLAY) {//0x75
        sprintf(mstatus_.ux_per_kwh, "%.3f", msg->FORMAT_SETTING.PriceKwh / 1000.0);
        sprintf(mstatus_.ux_max_kw, "%d", msg->FORMAT_SETTING.MaxPower);
        //msg->FORMAT_SETTING.Currency;                   //not ready
        if ((msg->FORMAT_SETTING.Language > 0) && (msg->FORMAT_SETTING.Language < 4)) {
            mstatus_.ux_culture = (LanguageList)(msg->FORMAT_SETTING.Language - 1);
        }
        else {
            mstatus_.ux_culture = LanguageList::ENGISH;
        }
        if (msg->FORMAT_SETTING.TelephoneNo != NULL)
            strncpy(mstatus_.ux_phone, (char*)msg->FORMAT_SETTING.TelephoneNo, 13);

        if (msg->FORMAT_SETTING.ChargePointSerNo != NULL)
            strncpy(mstatus_.ux_charger_id, (char*)msg->FORMAT_SETTING.ChargePointSerNo, 9);

        EnterPopupDelay = (msg->FORMAT_SETTING.EnterPopupDelay * TFT_FPS) >> FPS_DIV;
        ExitPopupDelay = (msg->FORMAT_SETTING.ExitPopupDelay * TFT_FPS) >> FPS_DIV;
        pp_count = 0;
        msg->EVBox_FormatEvent = msg->EVBox_FormatEvent & (~Event_SET_DISPLAY);
    }

    if (msg->EVBox_FormatEvent & Event_GET_UTC) {       //0x78
        char dt[21] = { ' ' };
        char y2;
        y2 = msg->FORMAT_UTC_ST.year - 2000;
        dt[0] = msg->FORMAT_UTC_ST.hour / 10 + '0';
        dt[1] = msg->FORMAT_UTC_ST.hour % 10 + '0';
        dt[2] = ':';
        dt[3] = msg->FORMAT_UTC_ST.minutes / 10 + '0';
        dt[4] = msg->FORMAT_UTC_ST.minutes % 10 + '0';
        dt[5] = ' ';
        dt[6] = msg->FORMAT_UTC_ST.month / 10 + '0';
        dt[7] = msg->FORMAT_UTC_ST.month % 10 + '0';
        dt[8] = '/';
        dt[9] = msg->FORMAT_UTC_ST.day / 10 + '0';
        dt[10] = msg->FORMAT_UTC_ST.day % 10 + '0';
        dt[11] = '/';
        dt[12] = '2';
        dt[13] = '0';
        dt[14] = y2 / 10 + '0';
        dt[15] = y2 % 10 + '0';
        strcpy(mstatus_.ux_datetime, dt);
        msg->EVBox_FormatEvent = msg->EVBox_FormatEvent & (~Event_GET_UTC);
    }

}
unsigned short  Model::GetRS485()
{
    if (L_EVBOX_FORMAT_API.EVBox_EventEn) {
        L_EVBOX_FORMAT_API.EVBox_EventEn = false;
        return EVBOX_ChargeBox_M_ID;
    }
    else if (R_EVBOX_FORMAT_API.EVBox_EventEn) {
        R_EVBOX_FORMAT_API.EVBox_EventEn = false;
        return EVBOX_ChargeBox_S_ID;
    }
    return 0;
}
void Model::SetBacklight(bool enable)
{
    if (enable)
        BSP_BL_On();
    else
        BSP_BL_Off();
}

bool Model::GetBacklight()
{
    return BSP_BL_GetState();
}
bool Model::GetProximity()
{
#ifndef SIMULATOR   
    return BSP_GetProximity();
#endif  
}
#endif
